### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [5]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [6]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [7]:
# len(set(purchase_data['SN']))

# purchase_data['SN'].nunique()


pd.DataFrame({'Total':[purchase_data['SN'].nunique()]})

   Total
0    576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:

nui = purchase_data['Item Name'].nunique() #179
ap = '$'+ str(round(purchase_data['Price'].mean(), 2)) # '$3.05'
np = purchase_data.shape[0] #780
tr = round(purchase_data['Price'].sum(), 2)#2379.77

pd.DataFrame({'Number of Unique Items':[nui], 'Average Price':[ap], 'Number of Purchases':[np], 'Total Revenue':[tr]})

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     179         $3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
player_count = purchase_data['SN'].nunique()

mc = purchase_data[purchase_data['Gender']=='Male']['SN'].nunique() #484
fc = purchase_data[purchase_data['Gender']=='Female']['SN'].nunique() #81
oc = player_count - mc - fc
mp = str(round((mc/player_count)*100,2)) + '%' #"84.03%"
fp = str(round((fc/player_count)*100,2)) + '%' #"14.06%"
op = str(round((oc/player_count)*100,2)) + '%' #"1.91%"
rowname = ['Male','Female','Other/Non-Disclosed']


pd.DataFrame({'Total Count':[mc,fc,oc], 'Percentage of Players':[mp,fp,op]},index=rowname)

                     Total Count Percentage of Players
Male                         484                84.03%
Female                        81                14.06%
Other/Non-Disclosed           11                 1.91%

In [18]:
purchase_data['Gender'] #*Filter the data frame, so that it shows the "Gender" column from the data frame.

0        Male
1        Male
2        Male
3        Male
4        Male
        ...
775    Female
776      Male
777      Male
778      Male
779      Male
Name: Gender, Length: 780, dtype: object

In [14]:
[purchase_data['Gender']== 'Male'] #* Give a filter which acts to show "if the value equals MALE, show True, if not, show FALSE."

[0       True
 1       True
 2       True
 3       True
 4       True
        ...
 775    False
 776     True
 777     True
 778     True
 779     True
 Name: Gender, Length: 780, dtype: bool]

In [13]:
purchase_data[purchase_data['Gender']== 'Male']  #*add "purchase_data" in the front, so it filters the data frame, and only shows any information related to Male only.

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [15]:
purchase_data[purchase_data['Gender']=='Male']['SN'] #* Adding "SN", so it only shows the SN column from the above step/data frame shown.

0            Lisim78
1        Lisovynya38
2         Ithergue48
3      Chamassasya86
4          Iskosia90
           ...
774       Jiskjask80
776           Iral74
777       Yathecal72
778          Sisur91
779        Ennrian78
Name: SN, Length: 652, dtype: object

In [17]:
purchase_data[purchase_data['Gender']=='Male']['SN'].nunique()  #*Adding 'NUNIQUE' (number of unique), so that it shows the total number of unique values from the SN column

484

In [21]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [46]:
purchase_data.groupby(["Gender"])

In [39]:
purchase_data.groupby(["Gender"]).sum()

                       Purchase ID    Age  Item ID    Price
Gender
Female                       42870   2412     9659   361.94
Male                        255921  14942    60698  1967.64
Other / Non-Disclosed         5019    363     1212    50.19

In [38]:
purchase_data.groupby(["Gender"]).sum()['Price']

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [45]:
purchase_data.groupby(["Gender"]).sum()['Price']['Female']

361.93999999999966

In [60]:
purchase_data.groupby(["Gender"]).count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [56]:
purchase_data.groupby(["Gender"]).count()["Price"]

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [58]:
purchase_data.groupby(["Gender"]).count()["Price"]['Female']

113

In [63]:
purchase_data.groupby(["Gender"]).mean()

                       Purchase ID        Age    Item ID     Price
Gender
Female                  379.380531  21.345133  85.477876  3.203009
Male                    392.516871  22.917178  93.095092  3.017853
Other / Non-Disclosed   334.600000  24.200000  80.800000  3.346000

In [64]:
purchase_data.groupby(["Gender"]).mean()['Price']

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [66]:
'$' + str(purchase_data.groupby(["Gender"]).mean()['Price']['Female'])

'$3.203008849557519'


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [71]:
fpc = purchase_data.groupby(["Gender"]).count()["Price"]['Female'] #113
mpc = purchase_data.groupby(["Gender"]).count()["Price"]['Male'] #652
opc = purchase_data.groupby(["Gender"]).count()["Price"]['Other / Non-Disclosed'] #15

fapp = '$' + str(purchase_data.groupby(["Gender"]).mean()['Price']['Female']) #$3.20'
mapp = '$' + str(purchase_data.groupby(["Gender"]).mean()['Price']['Male']) #$3.02'
oapp = '$' + str(purchase_data.groupby(["Gender"]).mean()['Price']['Other / Non-Disclosed']) #$3.35'

ftpv = '$' + str(purchase_data.groupby(["Gender"]).sum()['Price']['Female']) #$361.94'
mtpv = '$' + str(purchase_data.groupby(["Gender"]).sum()['Price']['Male']) #$1,967.64'
otpv = '$' + str(purchase_data.groupby(["Gender"]).sum()['Price']['Other / Non-Disclosed']) #$50.19'

fatpp = '$'+ str((purchase_data.groupby(["Gender"]).sum()['Price']['Female']) / fpc) #$4.47'? 
matpp = '$4.07'
oatpp = '$4.56'





rowname = ['Female','Male','Other/Non-Disclosed']

pd.DataFrame({'Purchase Count':[fpc,mpc,opc], 
              'Average Purchase Price':[fapp,mapp,oapp],
              'Total Purchase Value':[ftpv,mtpv,otpv],
              'Avg Total Purchase per Person':[fatpp,matpp,oatpp]},
             index=rowname)

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.203008849557519,$361.93999999999966,$3.203008849557519
Male,652,$3.0178527607361953,$1967.6399999999994,$4.07
Other/Non-Disclosed,15,$3.3460000000000005,$50.190000000000005,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [74]:
rowname = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

pd.DataFrame({'Total Count':[a,b,c,d,e,f,g,h], #Any faster/more efficient way to create this table?
              'Percentage of Players':[aa,bb,cc,dd,ee,ff,gg,hh],
             index=rowname)

SyntaxError: invalid syntax (<ipython-input-74-345ec6f2382e>, line 5)

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80